In [ ]:
import pandas as pd
from datetime import datetime

parquet = "../RawData/data.parquet"
df = pd.read_parquet(parquet)

df['Date'] = pd.to_datetime(df['Date'], format='%m/%Y', errors='coerce')

if df['Date'].isnull().any():
    print("Hatalı tarih formatı olan satırlar:")
    print(df[df['Date'].isnull()])

currentYear = datetime.now().year

df['Vehicle_Age'] = currentYear - df['Date'].dt.year

df = df.drop(columns=['Date'])
df = df.drop(columns=['Drive Type'])

df = df.dropna(how="any")

df.to_parquet("dataCleaned.parquet", index=False)

display(df.head())

,Brand,Model,Power,Mileage,Transmission,Fuel,Price,Vehicle_Age
0,Skoda,Octavia,81,,Automatic,Petrol,11199,8
1,Fiat,Ducato,103,90000km,Manual,Diesel,22749,3
2,Mercedes-Benz,Vito,120,170000km,Automatic,Diesel,19299,3
3,Chevrolet,Spark,50,161000km,Manual,Petrol,3399,12
4,Nissan,Micra,59,162000km,Manual,Petrol,2599,10

In [3]:
import numpy as np

df['Mileage'] = df['Mileage'].replace(["", "-", "None"], np.nan)

In [4]:
df.isnull().sum()

Brand           0
Model           0
Power           0
Mileage         1
Transmission    0
Fuel            0
Price           0
Vehicle_Age     0
dtype: int64

In [6]:
df.dropna(how='any', inplace=True)

In [7]:
df.isnull().sum()

Brand           0
Model           0
Power           0
Mileage         0
Transmission    0
Fuel            0
Price           0
Vehicle_Age     0
dtype: int64

In [8]:
display(df.head())

,Brand,Model,Power,Mileage,Transmission,Fuel,Price,Vehicle_Age
1,Fiat,Ducato,103,90000km,Manual,Diesel,22749,3
2,Mercedes-Benz,Vito,120,170000km,Automatic,Diesel,19299,3
3,Chevrolet,Spark,50,161000km,Manual,Petrol,3399,12
4,Nissan,Micra,59,162000km,Manual,Petrol,2599,10
5,Fiat,Doblo,66,55701km,Manual,Diesel,4699,9

In [9]:
df.replace(["", "-", "None"], np.nan, inplace=True)
df.isnull().sum()

Brand            0
Model            2
Power            0
Mileage          0
Transmission     0
Fuel            46
Price            0
Vehicle_Age      0
dtype: int64

In [10]:
df.dropna(how='any', inplace=True)

In [11]:
df.isnull().sum()

Brand           0
Model           0
Power           0
Mileage         0
Transmission    0
Fuel            0
Price           0
Vehicle_Age     0
dtype: int64

In [ ]:
df.to_parquet("dataCleaned.parquet", index=False)
display(df.head())

,Brand,Model,Power,Mileage,Transmission,Fuel,Price,Vehicle_Age
1,Fiat,Ducato,103,90000km,Manual,Diesel,22749,3
2,Mercedes-Benz,Vito,120,170000km,Automatic,Diesel,19299,3
3,Chevrolet,Spark,50,161000km,Manual,Petrol,3399,12
4,Nissan,Micra,59,162000km,Manual,Petrol,2599,10
5,Fiat,Doblo,66,55701km,Manual,Diesel,4699,9